Repository: common-repository/remote-database-api
Catalog: languages/*.po
Languages: fr_fr

source: Do you want to delete this table conversion?
fr_fr: Souhaitez-vous supprimer cette table ?

source: Do you want to delete this field conversion?
fr_fr: Souhaitez-vous supprimer cette conversion de champ ?

source: The conversion for this field already exists.
fr_fr: Ce champ existe déjà dans les conversions.

source: Remote Database API - Settings
fr_fr: Remote Database API - Réglage

source: Save changes
fr_fr: Enregistrer

source: Main settings
fr_fr: Réglages principaux

source: Airtable - API KEY
fr_fr: Airtable - Clé API

source: Airtable - Database ID
fr_fr: Airtable - Base de donnée par défaut

source: Airtable - View
fr_fr: Airtable - Vue par défaut

source: Cache lifetime
fr_fr: Durée du cache

source: Google Api Key
fr_fr: Clé Google API

source: Mapping with Airtable
fr_fr: Table de conversion avec Airtable

source: Mapping tables
fr_fr: Conversion des tables

source: You can also define a base and a default view when you leave these fields using the shortcode.
fr_fr: Vous pouvez définir une base et une vue par défaut qui seront utilisés lors de l’utilisation du shortcode.

source: You can create links between the column names and Airtable table id, and your own nomenclature to be used within the site.
fr_fr: Cette table de conversion vous permet d’utiliser des noms simple en remplacement du nom défini au sein de Airtable pour chaque Table. Vous pouvez à loisir les modifier chez Airtable, sans pour autant casser le fonctionnement des appels au sein de Wordpress : vous créez votre propre nomenclature.

source: You can set a time for the cache of all queries. If you leave empty or set the value to zero, no caching will be applied.
fr_fr: Vous pouvez définir d’un temps de mise en cache des valeurs associées aux requêtes vers l’API d’Airtable pour permettre une réponse plus rapide. Si vous laissez ce champs vide ou à 0, aucun cache ne sera mis en place, la durée du cache doit être indiquée en seconde.

source: Airtable table id
fr_fr: ID de la table Airtable

source: Internal table key
fr_fr: Clé interne de table

source: Delete
fr_fr: Supprimer

source: Airtable field id
fr_fr: Label de la colonne

source: Internal field key
fr_fr: Nom interne

source: Add new field conversion name
fr_fr: Ajouter une nouvelle conversion de champ

source: Add new table conversion name
fr_fr: Ajouter une nouvelle conversion de table

source: You have to set a -base- parameter.
fr_fr: Vous n’avez pas défini de paramètre type -base de donnée-

source: You have to set a -table- parameter.
fr_fr: Vous n’avez pas défini de paramètre type -table-

source: Get all records from table:
fr_fr: Récupérer tous les éléments de la table :

source: Get all records from specific view:
fr_fr: Récupérer tous les éléments de la vue :

source: Get specific record:
fr_fr: Récupérer un élément spécifique :

source: Update specific record:
fr_fr: Mettre à jour un élément :

source: Create record:
fr_fr: Créer un élément :

source: Error:
fr_fr: Erreur :

source: Empty table id.
fr_fr: ID de la table vide.

source: Template missing.
fr_fr: Modèle de page manquant.
